Revit 2026 API

# WallPaint Class

---

A static class that provides access to the property names that appear in the WallPaint visual asset schema.

SystemObject Autodesk.Revit.DB.VisualWallPaint

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class WallPaint
```
```vb
Public NotInheritable Class WallPaint
```
```cpp
public ref class WallPaint abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type WallPaint = class end
```

The WallPaint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CommonTintColor | The property labeled "Tint Color" from the "WallPaint" schema. |
|  | CommonTintToggle | The property labeled "Tint" from the "WallPaint" schema. |
|  | WallpaintApplication | The property labeled "Application" from the "WallPaint" schema. |
|  | WallpaintColor | The property labeled "Color" from the "WallPaint" schema. |
|  | WallpaintFinish | The property labeled "Finish" from the "WallPaint" schema. |

#### Reference

Autodesk.Revit.DB.Visual Namespace